Repository: wp-plugins/wp-flickr-press
Catalog: languages/wp-flickr-press-*.po
Languages: ro_ro

source: API KEY and API SECRET is required. Please setting API KEY and API SECRET.
ro_ro: Cheia API şi API secret este necesar. Vă rugăm să stabilirea API KEY şi API secret.

source: USER ID is required. Please setting USER ID.
ro_ro: ID utilizator este necesar. Vă rugăm să setarea ID utilizator.

source: Last Update:
ro_ro: Ultima actualizare:

source: Not yet been update. Please Update.
ro_ro: Nu a fost update. Vă rugăm să actualizaţi.

source: API KEY/Secret
ro_ro: API cheie/Secret

source: API KEY:
ro_ro: API-CHEIE:

source: OAuth Token
ro_ro: OAuth simbol

source: Update OAuth Token
ro_ro: Actualizare OAuth simbol

source: Default Attachments
ro_ro: Implicit ataşări

source: Link Target
ro_ro: Link-ul ţintă

source: Alignment
ro_ro: Aliniere

source: Size
ro_ro: Dimensiunea

source: Default Link Rel and Class Property
ro_ro: Link-ul Rel și clasa proprietate

source: Class:
ro_ro: Clasă:

source: Extend Link Rel and Class Property
ro_ro: Extinde Link Rel şi clasa proprietate

source: Title:
ro_ro: Titlu:

source: Save
ro_ro: Salvare

source: Remove
ro_ro: Eliminare

source: Clear
ro_ro: Clar

source: Current Available Extend Link Rel and Class
ro_ro: Curent disponibile extinde Link Rel şi clasa

source: Advanced Options
ro_ro: Opţiuni avansate

source: Insert Template
ro_ro: Inserare şablon

source: Avalable Options
ro_ro: Opţiunile disponibile

source: If you put a newline at the beginning or end, <br/> Please write tags.
ro_ro: Daca puneti o linie nouă de la începutul sau la sfârşitul, <br/> Va rugam sa scrie etichete.

source: However, <br/> if there is a line break before and after the tag, I been wrapped them too.
ro_ro: Cu toate acestea, <br/> dacă există un sfârşit de linie înainte şi după tag-ul, am fost prea le-împachetat.

source: Default Sort
ro_ro: Sortare implicită

source: Quick Settings
ro_ro: Rapid setările

source: Enable:
ro_ro: Permite:

source: When enabled, a dialog will appear when you click for a set of check boxes for multiple insertion.
ro_ro: Când este activat, un dialog va apărea atunci când faceţi clic pe un set de casete de selectare pentru introducerea mai multe.

source: Search Type
ro_ro: Tip Search

source: Save Changes
ro_ro: Salvaţi modificările

source: Upload/Insert %s
ro_ro: Încărcare/Inserare %s

source: Add flickr media
ro_ro: Adăugaţi flickr mass-media

source: Recent upload
ro_ro: Upload recente

source: Advanced
ro_ro: Avansate

source: Sort:
ro_ro: Sortare:

source: Keyword:
ro_ro: Cuvinte cheie:

source: Tags:
ro_ro: Tag-uri:

source: Search
ro_ro: Căutare

source: Search and clear cache
ro_ro: Căutare şi clear cache

source: Show
ro_ro: Arată

source: Hide
ro_ro: Ascunde

source: File name:
ro_ro: Nume fişier:

source: Title
ro_ro: Titlul

source: Link URL
ro_ro: URL-ul

source: None
ro_ro: Nici unul

source: File URL
ro_ro: Fişier URL

source: Page URL
ro_ro: URL-ul paginii

source: Enter a link URL or click above for presets.
ro_ro: Introduceţi un URL-ul sau faceţi clic pe sus de presetări.

source: Insert into Post
ro_ro: Inserare în Post

source: Batch Insert into Post
ro_ro: Pe loturi Inserare în Post

source: Order:
ro_ro: Comandă:

source: Update
ro_ro: Actualizare

source: Size:
ro_ro: Dimensiune:

source: Insert into Post and Close
ro_ro: Inserare în Post şi închide

source: Insert into Post and Continue
ro_ro: Inserare în Post şi continua

source: New Window
ro_ro: Fereastră nouă

source: Left
ro_ro: Stânga

source: Center
ro_ro: Centrul de

source: Right
ro_ro: Dreptul de

source: Small
ro_ro: Mici

source: Medium
ro_ro: Mediu

source: Large
ro_ro: Mare

source: Thumbnail
ro_ro: Miniatură

source: Square
ro_ro: Pătrat

source: Link Rel and Class Property
ro_ro: Link-ul Rel şi clasa proprietate

source: Image Class Property
ro_ro: Imagine clasa proprietate

source: Load Default
ro_ro: Încărcare implicit

source: Available Charactors: 0-9a-zA-Z [] Space UnderScore Hyphen
ro_ro: Charactors disponibile: [0-9a-zA-Z] spaţiu subliniere cratimă

source: No write permission to the %s directory. Please grant the permission to write.
ro_ro: Nici o permisiune de scriere pentru directorul %s. Vă rugăm să acorde permisiunea de a scrie.

source: Does not exists %s directory. Please create.
ro_ro: Nu există %s director. Vă rugăm să creaţi.

source: OAuth Information
ro_ro: OAuth informaţii

source: Enable UserID Alias
ro_ro: Permite UserID Alias

source: Photo URL contains "UserID" the "UserID Alias" and replace.
ro_ro: URL-ul conţine fotografii "nume de utilizator" "Alias ​​nume de utilizator" şi înlocuiţi.

source: Please use the copy to the callback URL of the Flickr apps created.
ro_ro: Vă rugăm să folosiţi copie de apel invers URL-ul apps Flickr creat.
